{
  "features": {
    "clippy": 0
  },
  "summary": "I'm a software engineer with a specialization in web development and a track record of success in robotics and team leadership. I'm committed to improving the access and quality of math education for all children and excited to build tools that help teachers help students learn more effectively. I'm also a US Citizen.",
  "skills": [
    "Javascript, React, Redux, Sass, CSS Modules",
    "Python, Django, AWS, Linux"
  ],
  "experience": [
    {
      "title": "Self-directed Post-Graduate Education",
      "date": "2018",
      "dateAlt": "December 2017 to Present",
      "itemsDefault": [
        "I've assembled my own curriculum of online courses, books, projects, and travel related to computer science and social justice"
      ],
      "itemsExpanded": [
        "I've assembled my own curriculum of online courses, books, projects, and travel related to computer science and social justice",
        "Computer Science study: Structure and Interpretation of Computer Programs (<a href='https://sarabander.github.io/sicp/html/index.xhtml' target='_blank'>MIT</a>), Intro to Algorithms (<a href='https://www.udacity.com/course/intro-to-algorithms--cs215' target='_blank'>Udacity</a>), Machine Learning and Data Mining (<a href='https://ubc-cs.github.io/cpsc340/' target='_blank'>UBC<a/>)",
        "Travel abroad: Hong Kong, India, Canada"
      ]
    },
    {
      "title": "Software Engineer, 3D Robotics",
      "date": "2017",
      "dateAlt": "October 2016 through November 2017",
      "itemsDefault": [
        "Built a complex and evolving web application in ReactJS, enabling visualization & interaction with construction site topography collected by drone",
        "Owned frontend development and maintenance together with 2-3 other engineers, occasionally picking up backend and drone software projects as needed.",
        "Worked remotely, allowing uninterrupted time for intense focus, while communicating effectively online."
      ],
      "itemsExpanded": [
        "Built a complex and evolving web application in ReactJS, enabling visualization & interaction with construction site topography collected by drone",
        "Owned frontend development and maintenance together with 2-3 other engineers, occasionally picking up backend and drone software projects as needed.",
        "Shipped an MVP early; achieved market leadership after one year of biweekly updates, measuring user feedback along the way with Amplitude and interviews",
        "Fun challenges included: PDF import and overlay on a map, real-time 3D Volume estimator and visualizer, Integration with nascent Autodesk APIs for team sync & file management.",
        "Worked remotely, allowing uninterrupted time for intense focus, while communicating effectively online."
      ],
      "itemsPrint": [
        "Built a complex and evolving web application, enabling visualization & interaction with construction site topography collected by drone",
        "Owned frontend development and maintenance together with 2-3 other engineers, occasionally picking up backend and drone software projects as needed.",
        "Shipped an MVP early; achieved market leadership after one year of biweekly updates, measuring user feedback along the way with Amplitude and interviews",
        "Fun challenges included: PDF import and overlay on a map, real-time 3D Volume estimator and visualizer, Integration with nascent Autodesk APIs for team sync & file management.",
        "Worked remotely, allowing uninterrupted time for intense focus, while communicating effectively online."
      ]
    },
    {
      "title": "Engineering Project Manager, 3D Robotics",
      "date": "2015-2016",
      "dateAlt": "January 2015 through October 2016",
      "itemsDefault": [
        "Responsible for systems integration and team coordination for <a href='https://3dr.com/solo-drone' target='_blank'>Solo</a>: the first mass-produced camera drone to be sold in major retail stores around the world"
      ],
      "itemsExpanded": [
        "Responsible for systems integration and team coordination for <a href='https://3dr.com/solo-drone' target='_blank'>Solo</a>: the first mass-produced camera drone to be sold in major retail stores around the world",
        "Led many ~3-month projects to release major software updates to the drone and accompanying mobile apps",
        "Ensured product quality by establishing integration testing processes and investigating complex issues with interdisciplinary teams",
        "Led by example to positively influence team dynamics and morale through the uncertainty of a radically changing product vision"
      ],
      "itemsPrint": [
        "Responsible for systems integration and team coordination for Solo: the first mass-produced camera drone to be sold in major retail stores around the world",
        "Ensured product quality by establishing integration testing processes and investigating complex issues with interdisciplinary teams"
      ]
    },
    {
      "title": "Team Lead and Controls Engineer, McGill Robotics",
      "date": "2011-2014",
      "dateAlt": "September 2011 through August 2014",
      "itemsDefault": [
        "Led a team of 98 students to build robots for two international competitions",
        "Built the control system for an autonomous underwater vehicle in c++"
      ],
      "itemsExpanded": [
        "Led a team of 98 students to build robots for two international competitions",
        "Built the control system for an autonomous underwater vehicle in c++",
        "Planned yearly design cycles and owned systems integration",
        "International competition results: 1st in branding, 3rd in design & presentation, 10th overall out of 39 teams at RoboSub 2014. 12th out of 50 at NASA in 2013"
      ],
      "itemsPrint": [
        "Led a team of 98 students to build robots for two international competitions"
      ]
    },
    {
      "title": "Summer Internships, McGill University",
      "date": "2011-2013",
      "dateAlt": "May through August for three summers",
      "itemsDefault": [
        "Software development in Python and MATLAB in support of a variety of research objectives"
      ],
      "itemsExpanded": [
        "Software development in Python and MATLAB in support of a variety of research objectives",
        "2011: Developed a Graphical User Interface in Python for turbomachinery simulations",
        "2012: Developed a physics simulator in MATLAB to study granular dynamics",
        "2013: Designed and conducted experiments on a quadrotor aircraft and LiDAR to facilitate autonomous takeoff and landing; published results at ICUAS 2014"
      ],
      "itemsPrint": [
        "Software development in Python and MATLAB in support of a variety of research objectives"
      ]
    },
    {
      "title": "Side Projects",
      "itemsDefault": [
        "Built a variety of (mostly web-) applications to learn and solve problems. Detail at <a href='http://www.speal.ca/projects/' taret='_blank'>speal.ca/projects</a>"
      ],
      "itemsExpanded": [
        "Built a variety of (mostly web-) applications to learn and solve problems.",
        "<a href='http://www.speal.ca/net-zero' target='_blank'>Tract:<a> A carbon footprint tracking tool (ReactJS)",
        "<a href='http://www.speal.ca/virtual-high' target='_blank'>Virtual High:<a> A satirical critique of educational software trends (ReactJS)",
        "<a href='http://discoverlive.speal.ca' target='_blank'>Discover Live:<a> A concert discovery service (Python/Django/ReactJS)",
        "<a href='http://www.speal.ca/projects/brailleuniversity/' target='_blank'>Braille University:<a> An accessible app to teach braille (ObjectiveC)",
        "More detail at <a href='http://www.speal.ca/projects/' target='_blank'>speal.ca/projects</a>"
      ],
      "itemsPrint": [
        "Find a library of (mostly web-) applications I've built at speal.ca/projects"
      ]
    }
  ],
  "coverletter": {
    "date": "June 21, 2018",
    "salutation": "To Mr. Berger and the Desmos engineering team,",
    "body": [
      "I'm a software engineer with a specialization in web development and a background in team leadership and robotics. I care deeply about writing software that distributes rather than concentrates opportunity and was thrilled to sense the same attitude when I met Cori and Denis at Jenny's Design Week talk last week. I'd love to join your team as a software engineer and help make sure that all students have access to the very best math education.",
      "Rigorously trained in engineering fundamentals at McGill University, I earned a GPA of 3.9 and a reputation for perseverance when solving challenging problems. Building production software at 3D Robotics and fun projects on the side, I've most enjoyed frontend work because it is closest to the user. As one of four teammates building out a geospatial data visualization application in ReactJS, I took ownership of meeting end-to-end product requirements. Often this meant coming up with creative ways to manipulate 3D data or quickly learning new tools to integrate with existing customer workflows. My background in controls and robotics engineering has left me with a mindset for ensuring quality when developing mission-critical software systems for mass production.",
      "One aspect of my resume that I hope will stand out is the leadership experience I gained in project management roles. After 4 years of focusing on team productivity and cross-functional integration, I’ve developed empathy and an understanding of the different ways people are motivated and work together. My references will tell you how this has led to team success over and over again. ",
      "Despite my enthusiasm for building robots, I've reoriented my focus towards education because I believe it's the best opportunity we have to use software to tackle social inequity. Historically marginalized groups are underrepresented in STEM fields and I hope that better access to quality math education can be an early intervention that helps correct this injustice.",
      "I'm impressed with Desmos' commitment to enabling teachers to improve student outcomes, as opposed to just hollow metrics, and this is a mission I want to be a part of. Please email me to schedule a call to discuss further."
    ],
    "closing": "Thank you for your consideration,"
  }
}
